#include "../cmath.h"

int main() {
  cout << "=============================================\n";
  cout << "           Контекстное меню задания          \n";
  cout << "---------------------------------------------\n";
  cout << "Суть задания: Рядовое приближение функции для заданных чисел\n";
  cout << "Задание выполнил: Кудрицкий Константин\n";
  cout << "Вариант: 9" << endl;

  int n, quantity;
  double y, s, x;
  char answer;

  do {
    cout << "Введите количество членов ряда, затем количество чисел от которых считаем функцию:" << endl;
    while(!(cin >> n >> quantity) || n <= 0 || quantity <= 0) {
      cout << "Введите корректные значения(значения должны быть положительными)" << endl;
      cin.clear();
      cin.ignore(1000000, '\n');
    }
    
    for (int i = 0; i < quantity; ++i) {
      cout << "Введите значение x(от 0.1 до 1)) для расчета значения функции:" << endl;
      while(!(cin >> x) || x < 0.1 || x > 1) {
        cout << "Введите корректное значение(от 0.1 до 1)" << endl;
        cin.clear();
        cin.ignore(100000, '\n');
      }

      y = ((x * x / 4) + (x / 2) + 1) * Pow(Exp(1), (x / 2));
      
      s = 0;
      for (int i = 0; i < n; ++i) {
        s += ((i * i + 1) / Factorial(i)) * (Pow(x / 2, i));
      }

      cout << "Значение функции при x = " << x << " для ряда s = " << s  << ", для стандартной функции y = " << y << endl;
    }

    cout << "Желаете закончить программу? (y or n)" << endl;

    while (!(cin >> answer) || (answer != 'n' && answer != 'y')) {
      cout << "Введите y or n" << endl;
      cin.clear();
      cin.ignore(1000000, '\n');
    }
  } while (answer == 'n');
}